# Jupyter Notebook Example using Pandas

Early notebook with far less Markdown commentary than later notebooks but intention is to show use of Pandas through example.  Read the comments in the code itself for guidance.

# DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.

In [5]:
#DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.
import pandas as pd

print("Define a dictionary of Series, one with an integer and float array.")
print("################################################################################################################")
my_dictionary = {'array_one': pd.Series([1,2,3,4,5,6,7,8,9]),
                 'array_two': pd.Series([1.0,2.0,3.0,4.0,5.0,6.0,7.0,8.0,9.0])}
print("")
print("Transform that dictinary of Series into a DataFrame")
my_dataframe=pd.DataFrame(my_dictionary)

print("################################################################################################################")
print("Simply calling print on the data frame shows the contents as two columns, one for each dictionary element")
print(my_dataframe)
print("")
print("Note that if the dictionaries are not the same size, they are uniond and 'NaN' padded for missing values.")

Define a dictionary of Series, one with an integer and float array.
################################################################################################################

Transform that dictinary of Series into a DataFrame
################################################################################################################
Simply calling print on the data frame shows the contents as two columns, one for each dictionary element
   array_one  array_two
0          1        1.0
1          2        2.0
2          3        3.0
3          4        4.0
4          5        5.0
5          6        6.0
6          7        7.0
7          8        8.0
8          9        9.0

Note that if the dictionaries are not the same size, they are uniond and 'NaN' padded for missing values.

In [6]:
print("Adding a column is as simple as declaring another dictionary element")
print("################################################################################################################")
my_dataframe['array_three']= my_dataframe['array_one'] * my_dataframe['array_two']
print("")
print("After performing a multiplication of array_one and array_two, you should see an square floating point result")
print("################################################################################################################")
print(my_dataframe)
print("")
print("Now we show algorithmic decisions for a 'flag' column for values that aren't even")
print("################################################################################################################")
my_dataframe['flag']=my_dataframe['array_three'] % 2 != 0
print(my_dataframe)
print("")
print("Now we remove the 'flag' column")
print("################################################################################################################")
my_dataframe.pop('flag')

Adding a column is as simple as declaring another dictionary element
################################################################################################################

After performing a multiplication of array_one and array_two, you should see an square floating point result
################################################################################################################
   array_one  array_two  array_three
0          1        1.0          1.0
1          2        2.0          4.0
2          3        3.0          9.0
3          4        4.0         16.0
4          5        5.0         25.0
5          6        6.0         36.0
6          7        7.0         49.0
7          8        8.0         64.0
8          9        9.0         81.0

Now we show algorithmic decisions for a 'flag' column for values that aren't even
################################################################################################################
   array_one  array_two  array_three   flag
0          1        1.0          1.0   True
1          2        2.0          4.0  False
2          3        3.0          9.0   True
3          4        4.0         16.0  False
4          5        5.0         25.0   True
5          6        6.0         36.0  False
6          7        7.0         49.0   True
7          8        8.0         64.0  False
8          9        9.0         81.0   True

Now we remove the 'flag' column
################################################################################################################

0     True
1    False
2     True
3    False
4     True
5    False
6     True
7    False
8     True
Name: flag, dtype: bool

# Pro-tips for Pandas Use

In [9]:
#examples of extracting data in various ways

print("Data has:" + str(my_dataframe.columns))
print("    size:" + str(my_dataframe.size))
print("    shape:" + str(my_dataframe.shape))
print("    ndim:" + str(my_dataframe.ndim))
print("    column size:" + str(my_dataframe.columns.size))

Data has:Index(['array_one', 'array_two', 'array_three'], dtype='object')
    size:27
    shape:(9, 3)
    ndim:2
    column size:3

# Data Science type description of your Pandas Dataframe

In [10]:
my_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   array_one    9 non-null      int64
 1   array_two    9 non-null      float64
 2   array_three  9 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 344.0 bytes

# Just show the top records

In [11]:
my_dataframe.head(2)

   array_one  array_two  array_three
0          1        1.0          1.0
1          2        2.0          4.0

# Or you can get an array of column names and a generic type returned

In [12]:
#show column header names.
print(my_dataframe.columns)

Index(['array_one', 'array_two', 'array_three'], dtype='object')

# Want Stats...Pandas has them

In [13]:
my_dataframe.describe()

       array_one  array_two  array_three
count   9.000000   9.000000     9.000000
mean    5.000000   5.000000    31.666667
std     2.738613   2.738613    28.080242
min     1.000000   1.000000     1.000000
25%     3.000000   3.000000     9.000000
50%     5.000000   5.000000    25.000000
75%     7.000000   7.000000    49.000000
max     9.000000   9.000000    81.000000

# Column name changes are a joke

## Just remember that the old columns will remain so you'll want to remove them

In [14]:
my_dataframe['A_new_column'] = my_dataframe['array_one'] * 10

In [15]:
my_dataframe.describe()

       array_one  array_two  array_three  A_new_column
count   9.000000   9.000000     9.000000      9.000000
mean    5.000000   5.000000    31.666667     50.000000
std     2.738613   2.738613    28.080242     27.386128
min     1.000000   1.000000     1.000000     10.000000
25%     3.000000   3.000000     9.000000     30.000000
50%     5.000000   5.000000    25.000000     50.000000
75%     7.000000   7.000000    49.000000     70.000000
max     9.000000   9.000000    81.000000     90.000000

# Do we need to remove a column?

In [17]:
my_dataframe.drop(columns=['A_new_column' ], inplace=True)

In [18]:
my_dataframe.describe()

       array_one  array_two  array_three
count   9.000000   9.000000     9.000000
mean    5.000000   5.000000    31.666667
std     2.738613   2.738613    28.080242
min     1.000000   1.000000     1.000000
25%     3.000000   3.000000     9.000000
50%     5.000000   5.000000    25.000000
75%     7.000000   7.000000    49.000000
max     9.000000   9.000000    81.000000

# Example Lambda Expression and Bulk Modification

In [19]:
#delete values for a very specific record
#df['Annual_Zero'] = df.apply(lambda row: row.Annual - df.loc[0,'Annual'], axis=1)

my_dataframe['array_one_ZERO'] = my_dataframe.apply(lambda row: row.array_one - row.array_one, axis=1)

my_dataframe['array_one_MINUS_10_PERCENT'] = my_dataframe['array_one'] - (my_dataframe['array_one'] * 0.10)

In [20]:
my_dataframe.describe()

,array_one,array_two,array_three,array_one_ZERO,array_one_MINUS_10_PERCENT
count,9.000000,9.000000,9.000000,9.0,9.000000
mean,5.000000,5.000000,31.666667,0.0,4.500000
std,2.738613,2.738613,28.080242,0.0,2.464752
min,1.000000,1.000000,1.000000,0.0,0.900000
25%,3.000000,3.000000,9.000000,0.0,2.700000
50%,5.000000,5.000000,25.000000,0.0,4.500000
75%,7.000000,7.000000,49.000000,0.0,6.300000
max,9.000000,9.000000,81.000000,0.0,8.100000